<script>
import Header from "@/components/header/main/Header.vue";
import Footer from "@/components/footer/Footer.vue";

export default {
    name: 'Offer',

    components: {
        Header,
        Footer
    }
}
</script>

<template>
    <Header />

    <section class="offer">
        <div class="container">
            <div class="offer__wrapper">
                <div class="offer__breadcrumbs">
                    <a href="/">Главная</a> / <span>Публичная оферта</span>
                </div>
                <div class="offer__container">
                    <h1 class="offer__title">
                        Публичная оферта на заключение договора розничной купли-продажи
                    </h1>

                    <div class="offer__section">
                        <h2 class="offer__section-title">1. Термины и определния</h2>
                        <div class="offer__content">
                            <p class="offer__paragraph"><span class="offer__term">1.1. Мобильное приложение (в том числе, Сайт)</span> — приложение (ресурс) «BurgerKing» для Android и iOS с возможностью удобного выбора и заказа Продукции в режиме реального времени.</p>
                            <p class="offer__paragraph"><span class="offer__term">1.2. Продавец</span> — ИП ООО «FAST FOOD SYSTEMS».</p>
                            <p class="offer__paragraph"><span class="offer__term">1.3. Товары</span> – перечень продукции Продавца, представленный в Приложении и на Сайте. Товары могут отличаться от изображения в Приложении и на Сайте.</p>
                            <p class="offer__paragraph"><span class="offer__term">1.4. Покупатель</span> – любое дееспособное лицо, намеренное заказать или приобрести, либо заказывающий, приобретающий или использующий Товары исключительно для личных, семейных, домашних или иных нужд, не связанных с осуществлением предпринимательской деятельности.</p>
                            <p class="offer__paragraph"><span class="offer__term">1.5. Оферта</span> — настоящий публичный договор, который регулирует отношения между Продавцом и Покупателем.</p>
                        </div>
                    </div>

                    <div class="offer__section">
                        <h2 class="offer__section-title">2. Общие положения</h2>
                        <div class="offer__content">
                            <p class="offer__paragraph">2.1. Покупатель обязуется ознакомиться с условиями настоящей оферты.</p>
                            <p class="offer__paragraph">2.2. Продавец оставляет за собой право вносить изменения в настоящую оферту, в связи с чем Покупатель обязуется самостоятельно отслеживать наличие изменений в настоящей оферте.</p>
                            <p class="offer__paragraph">2.3. При оформлении заказа Товаров Покупатель тем самым подтверждает, что он исполнил обязанности, предусмотренные пунктом 2.2. настоящей оферты.</p>
                            <p class="offer__paragraph">2.4. Договор розничной купли-продажи по образцам считается заключенным с момента получения Продавцом сообщения о намерении Покупателя приобрести Товары.</p>
                            <p class="offer__paragraph">2.5. Срок, в течение которого действует предложение о заключении договора розничной купли-продажи по образцам, является бессрочным.</p>
                        </div>
                    </div>

                    <div class="offer__section">
                        <h2 class="offer__section-title">3. Предмет Договора</h2>
                        <div class="offer__content">
                            <p class="offer__paragraph">3.1. Продавец продает Товары, указанные в Мобильном приложении и на Сайте, по ценам, указанным в Мобильном приложении, на Сайте соответственно; доставляет Товар Курьерской службой, а Покупатель производит оплату и принимает Товары в соответствии с условиями настоящей оферты.</p>
                            <p class="offer__paragraph">3.2. Право собственности и риск случайной гибели/повреждения Товаров переходит к Покупателю в момент приемки Товаров Покупателем.</p>
                        </div>
                    </div>

                    <div class="offer__section">
                        <h2 class="offer__section-title">4. Уведомления покупателя</h2>
                        <div class="offer__content">
                            <p class="offer__paragraph">4.1. Продавец (или иное лицо по поручению Продавца) вправе отправлять сервисные сообщения (в том числе push-уведомления), информирующие Покупателя о совершенном им заказе, этапах его обработки. Такие сервисные сообщения отправляются автоматически, не могут быть отклонены Покупателем, направлены на контроль качества оказания услуг Покупателю и его информирование о надлежащем исполнении Продавцом своих обязательств по договору купли-продажи по образцам.</p>
                        </div>
                    </div>

                    <div class="offer__section">
                        <h2 class="offer__section-title">5. Оформление заказа товаров</h2>
                        <div class="offer__content">
                            <p class="offer__paragraph">5.1. Заказ Покупателя оформляется посредством заполнения электронной формы заказа в Мобильном приложении или на Сайте.</p>
                            <p class="offer__paragraph">5.2. Покупатель обязуется предоставить достоверные данные, необходимые и достаточные для исполнения договора розничной купли-продажи Товаров по образцам.</p>
                            <p class="offer__paragraph">5.3. В случае возникновения у Покупателя дополнительных вопросов, касающихся Товаров, перед оформлением заказа, Покупатель должен обратиться к Продавцу для получения необходимой информации, в соответствии с режимом работы, указанным в Мобильном приложении или на Сайте.</p>
                            <p class="offer__paragraph">5.4. Покупатель может заказать только те Товары, которые есть в наличии у Продавца в момент оформления заказа Товаров у Продавца.</p>
                            <p class="offer__paragraph">5.5. Покупатель не имеет право изменить состав заказа после его оформления в Мобильном приложении или на Сайте.</p>
                            <p class="offer__paragraph">5.6. Если у Продавца отсутствует необходимое количество или ассортимент заказанных Покупателем Товаров, Продавец информирует об этом Покупателя после получения заказа Товаров от Покупателя, но до подтверждения принятия заказа посредством push-оповещения. Покупатель вправе согласиться принять Товары в ином количестве или ассортименте, либо аннулировать свой заказ Товаров. В случае неполучения ответа Покупателя Продавец вправе аннулировать заказ Покупателя в полном объеме.</p>
                            <p class="offer__paragraph">5.7. Продавец вправе временно приостановить прием заказов Товаров в случае технических неполадок, не позволяющих принять заказы Товаров, или отсутствия ингредиентов, необходимых для изготовления Товаров.</p>
                        </div>
                    </div>

                    <div class="offer__section">
                        <h2 class="offer__section-title">6. Доставка товаров</h2>
                        <div class="offer__content">
                            <p class="offer__paragraph">6.1. Доставка Товаров осуществляется Курьерской службой по фактическому адресу, указанному Покупателем при оформлении заказа, или передачей Товаров Покупателю в месте реализации Товаров (самовывоз).</p>
                            <p class="offer__paragraph">6.2. Доставка Товаров в пределах зоны доставки осуществляется в соответствии с режимом работы Продавца, указанным в Мобильном приложении или на Сайте.</p>
                            <p class="offer__paragraph">6.3. Доставка Товаров по адресам, не входящим в зону доставки, не осуществляется.</p>
                            <p class="offer__paragraph">6.4. Доставка осуществляется при условии заказа Товаров на сумму минимального заказа, если минимальный заказ предусмотрен Продавцом. В таком случае, сумма минимального заказа определяется Продавцом в одностороннем порядке и указывается в Мобильном приложении и на Сайте.</p>
                            <p class="offer__paragraph">6.5. Продавец вправе отказаться от исполнения договора розничной купли-продажи по образцам в том случае, если Курьерская служба по прибытии к фактическому адресу доставки Покупателя не может осуществить фактическую передачу доставленных Товаров по вине Покупателя (Покупатель в течение 10 минут не отвечает на телефонный вызов или не открывает дверь Курьерской службе).</p>
                            <p class="offer__paragraph">6.6 Время доставки товаров согласовывается с операторами и может отличаться от времени доставки, указанного в приложении и на Сайте.</p>
                        </div>
                    </div>

                    <div class="offer__section">
                        <h2 class="offer__section-title">7. Оплата товаров</h2>
                        <div class="offer__content">
                            <p class="offer__paragraph">7.1. Цены на Товары определяются Продавцом в одностороннем порядке и указываются в Мобильном приложении и на Сайте. Цена на заказанный Покупателем Товар изменению не подлежит.</p>
                            <p class="offer__paragraph">7.2. Оплата Товаров Покупателем производится одним из следующих способов:</p>
                            <p class="offer__paragraph">7.2.1. оплата осуществляется по факту получения Товаров наличными денежными средствами;</p>
                            <p class="offer__paragraph">7.2.2. безналичными расчетами банковской картой по факту получения Товаров, при условии оснащения Курьерской службы мобильными POS-терминалами (о наличии возможности произвести оплату Товаров данным способом следует уточнять у Продавца).</p>
                            <p class="offer__paragraph">7.3. Выдача либо направление Покупателю кассового чека:</p>
                            <p class="offer__paragraph">7.3.1. На бумажном носителе, в случае совершения заказа Товаров через Телефон и оплаты в порядке, предусмотренном пунктом 7.2.1 настоящей оферты, пунктом 7.2.2 настоящей оферты.</p>
                            <p class="offer__paragraph">7.3.2. В электронном виде на электронную почту Покупателя, в случае совершения заказа Товаров через Мобильное приложение или Сайт и оплаты Товаров в порядке, предусмотренном пунктом.</p>
                            <p class="offer__paragraph">7.3.3. При безналичных расчетах банковской картой Покупателю рекомендуется сохранять подтверждения об оплате.</p>
                            <p class="offer__paragraph">7.4. Покупатель вправе в любое время обратиться к Продавцу с просьбой об отмене транзакции при оплате заказа путем безналичного расчета банковской картой до момента реализации Товара Покупателю. Решение о возврате денежных средств принимается Продавцом с учетом требований законодательства Республики Узбекистан и всех сложившихся обстоятельств.</p>
                            <p class="offer__paragraph">7.5. Возврат переведённых средств, производится на ваш банковский счёт в течение 5-30 рабочих дней (срок зависит от банка, который выдал вашу банковскую карту).</p>
                        </div>
                    </div>

                    <div class="offer__section">
                        <h2 class="offer__section-title">8. Возврат и обмен товаров</h2>
                        <div class="offer__content">
                            <p class="offer__paragraph">8.1. Возврат Товара надлежащего качества не допускается.</p>
                            <p class="offer__paragraph">8.2. Продавец обязан передать Покупателю Товары, которые полностью соответствуют его заказу, качество которых соответствует информации, представленной Покупателю при заключении договора розничной купли-продажи по образцам, а также информации, доведенной до его сведения при передаче Товаров (на этикетке или вкладыше, прикрепленных к Товарам или их упаковке, либо другими способами, предусмотренными для отдельных видов Товаров).</p>
                            <p class="offer__paragraph">8.3. При получении Товаров Покупатель проверяет соответствие полученных Товаров своему заказу, комплектность и отсутствие претензий к внешнему виду доставленных Товаров в течение 10 (Десяти) минут после получения Товаров.</p>
                            <p class="offer__paragraph">8.4. В случае получения некачественных Товаров, либо несоответствия полученных Товаров заказанному (отсутствие заявленных ингредиентов в Товаре), Покупатель вправе потребовать замены таких Товаров Товарами надлежащего качества сразу в течение 5 (Пяти) минут после проверки соответствия полученного Товара.</p>
                            <p class="offer__paragraph">8.5. В случае несоблюдения порядка предъявления претензии Покупателя по внешнему виду Товаров и их комплектности, предусмотренных пунктом 8.3, пунктом 8.4 настоящей оферты, претензии не принимаются.</p>
                        </div>
                    </div>

                    <div class="offer__section">
                        <h2 class="offer__section-title">9. Форс-мажор</h2>
                        <div class="offer__content">
                            <p class="offer__paragraph">9.1. Любая из Сторон освобождается от ответственности за полное или частичное неисполнение своих обязательств по настоящей оферте, если это неисполнение было вызвано обстоятельствами непреодолимой силы. Обстоятельства непреодолимой силы означают чрезвычайные события и обстоятельства, которые Стороны не могли ни предвидеть, ни предотвратить разумными средствами. Такие чрезвычайные события или обстоятельства включают в себя, в частности: забастовки, наводнения, пожары, землетрясения и иные стихийные бедствия, войны, военные действия и так далее.</p>
                        </div>
                    </div>

                    <div class="offer__section">
                        <h2 class="offer__section-title">10. Ответственность сторон публичной оферты</h2>
                        <div class="offer__content">
                            <p class="offer__paragraph">10.1. Продавец не несет ответственности за ущерб, причиненный Покупателю вследствие ненадлежащего использования им Товаров, приобретённых у Продавца.</p>
                            <p class="offer__paragraph">10.2. Продавец не отвечает за убытки Покупателя, возникшие в результате неправильного заполнения заказа, в том числе неправильного указания своих данных.</p>
                            <p class="offer__paragraph">10.3. В случае злоупотребления Покупателем правами потребителя, включая, но не ограничиваясь, если Покупатель отказался от приемки и/или оплаты заказанного и доставленного Товара, Продавец вправе реализовать свое право на самозащиту, а именно: не принимать от него заказы в будущем.</p>
                        </div>
                    </div>

                </div>
            </div>
        </div>
    </section>

    <Footer />
</template>

<style src="./offer.css" scoped>
</style>

