<script>
import JobsItem from "@/components/jobs/item/JobsItem.vue";

export default {
    name: "Jobs",

    components: {
        JobsItem
    },

    data() {
        return {
            vacancies: [
                {
                    id: 1,
                    title: "Работник ресторана",
                    text: '<p><b>Локации, где доступна вакансия</b></p><ul><li>Seoul Moon, Ташкент, ул. Баходира, 67/1.</li><li>Alpomish, Ташкент, ул. Беруний, 41.</li><li>ТЦ Tashkent City Mall, Ташкент, ул. Ботира Закира, 7.</li></ul><p><b>Кого рассматриваем на эту роль</b></p><ul><li><b>Возраст от 16 лет</b> и старше.</li><li>Опыт работы в аналогичной сфере (общественное питание быстрого обслуживания).</li><li>Знание стандартов пищевой безопасности <b>НАССР</b> (если опыта нет, предлагаем начать с должности работника ресторана-стажёра).</li></ul><p><b>Что мы предлагаем</b></p><ul><li><b>Зарплата от 3 200 000 сумов</b> – зависит от количества смен и часов + KPI. Прозрачная система выплат: вы видите, сколько отработали и заработали.</li><li>Питание <b>1 раз за смену</b>, униформа и медкнижки — за счёт компании.</li><li>Компенсация такси для сотрудников, которые заканчивают работу <b>после 22:00</b>.</li><li>Оформление по <b>ТК РУз</b>: официальные начисления, ежегодный отпуск <b>21 день</b>, больничные, декретные и другие предусмотренные законом льготы.</li><li>Удобный график. Длительность и дни смен выбираете вы сами. Возможны смены на <b>8, 6 или 4 часа</b>.</li><li>Возможности карьерного роста с прозрачной системой оценки и обучением. У каждого есть <b>персональный план развития</b> и понятные критерии повышения.</li></ul>'
                },
                {
                    id: 2,
                    title: "Работник ресторана (стажёр)",
                    text: '<p><b>Локации, где доступна вакансия</b></p><ul><li>Seoul Moon, Ташкент, ул. Баходира, 67/1.</li><li>Alpomish, Ташкент, ул. Беруний, 41.</li><li>ТЦ Tashkent City Mall, Ташкент, ул. Ботира Закира, 7.</li></ul><p><b>Кого рассматриваем на эту роль</b></p><ul><li><b>Возраст от 16 лет</b> и старше.</li><li>Опыт работы <b>не требуется</b> — всему обучаем. Наставник проведёт экскурсию, обучение и поможет в первые дни.</li><li>Обучение доступно на <b>русском и узбекском</b> языках — выбирайте удобный.</li></ul><p><b>Что мы предлагаем</b></p><ul><li><b>Зарплата от 2 800 000 сумов</b> — зависит от количества смен и часов + KPI. Прозрачная система выплат.</li><li>Питание <b>1 раз за смену</b>, униформа и медкнижки — за счёт компании.</li><li>Компенсация такси для сотрудников, которые заканчивают работу <b>после 22:00</b>.</li><li>Оформление по <b>ТК РУз</b>: официальные начисления, ежегодный отпуск <b>21 день</b>, больничные, декретные и другие предусмотренные законом льготы.</li><li>Удобный график. Длительность и дни смен выбираете вы сами. Возможны смены на <b>8, 6 или 4 часа</b>.</li><li>Возможности карьерного роста с прозрачной системой оценки и обучением. У каждого есть <b>персональный план развития</b> и понятные критерии повышения.</li></ul>'
                },
                {
                    id: 3,
                    title: "Тренер-инструктор",
                    text: '<p><b>Локации, где доступна вакансия</b></p><ul><li>Seoul Moon, Ташкент, ул. Баходира, 67/1.</li><li>Alpomish, Ташкент, ул. Беруний, 41.</li><li>ТЦ Tashkent City Mall, Ташкент, ул. Ботира Закира, 7.</li></ul><p><b>Чем вы будете заниматься?</b></p><ul><li>Работа на кассе и на кухне (универсальный сотрудник).</li><li>Обучение новых сотрудников (за эту функцию доход выше, чем у обычного сотрудника).</li></ul><p><b>Кого рассматриваем на эту роль</b></p><ul><li><b>Возраст от 18 лет</b> и старше.</li><li>Требуется <b>опыт работы</b> в ресторанах быстрого обслуживания (если опыта нет, можно начать с должности стажёра).</li></ul><p><b>Что мы предлагаем</b></p><ul><li><b>Зарплата от 4 500 000 сумов</b>. Почасовая оплата: больше смен — выше доход + KPI.</li><li>Питание <b>1 раз за смену</b>, униформа и медкнижки — за счёт компании.</li><li>Компенсация такси для сотрудников, которые заканчивают работу <b>после 22:00</b>.</li><li>Оформление по <b>ТК РУз</b>: официальные начисления, ежегодный отпуск <b>21 день</b>, больничные, декретные и другие предусмотренные законом льготы.</li><li>График <b>5/2</b> (выходные по согласованию; можно работать меньше дней в неделю, совмещая с учёбой).</li><li>Возможности карьерного роста с прозрачной системой оценки и обучением. У каждого есть <b>персональный план развития</b> и понятные критерии повышения.</li></ul>'
                },
                {
                    id: 4,
                    title: "Менеджер ресторана",
                    text: '<h3>Менеджер ресторана</h3><p><b>Локации, где доступна вакансия</b></p><ul><li>Seoul Moon, Ташкент, ул. Баходира, 67/1.</li><li>Alpomish, Ташкент, ул. Беруний, 41.</li><li>ТЦ Tashkent City Mall, Ташкент, ул. Ботира Закира, 7.</li></ul><p><b>Чем вы будете заниматься?</b></p><ul><li>Управление процессами в ресторане (кухня, касса, работа с гостями и др.).</li></ul><p><b>Кого рассматриваем на эту роль</b></p><ul><li><b>Возраст от 18 лет</b> и старше.</li><li>Опыт управленческой работы в <b>HoReCa</b> обязателен.</li></ul><p><b>Что мы предлагаем</b></p><ul><li><b>Зарплата 6 000 000 – 12 000 000 сумов</b> в месяц (в зависимости от опыта и компетенций) + KPI.</li><li>Питание <b>1 раз за смену</b>, униформа и медкнижки — за счёт компании.</li><li>Компенсация такси для сотрудников, которые заканчивают работу <b>после 22:00</b>.</li><li>Оформление по <b>ТК РУз</b>: официальные начисления, ежегодный отпуск <b>21 день</b>, больничные, декретные и другие предусмотренные законом льготы.</li><li>График <b>5/2</b> (выходные по согласованию).</li><li><b>8-часовые смены</b>, перерыв 1 час. Готовность по сменам обсуждается индивидуально.</li><li>Карьерный рост и обучение по прозрачной системе оценки.</li></ul>'
                }
            ]
        }
    }

}
</script>

<template>
    <div class="vJobs">
        <h2 class="vJobs__title">Нам нужны в команду</h2>
        <div class="vJobs__list">
            <JobsItem
                v-for="vacancy in vacancies"
                :key="vacancy.id"
                :title="vacancy.title"
                :text="vacancy.text"
            />
        </div>
    </div>
</template>

<style src="./jobs.css" scoped>
</style>