<script>
import Header from "@/components/header/main/Header.vue";
import Footer from "@/components/footer/Footer.vue";

export default {
    name: 'Privacy',

    components: {
        Header,
        Footer
    }
}
</script>

<template>
    <Header />

    <section class="privacy">
        <div class="container">
            <div class="privacy__wrapper">
                <div class="privacy__breadcrumbs">
                    <a href="/">Главная</a> / <span>Политика конфиденциальности</span>
                </div>
                <div class="privacy__container">
                    <h1 class="privacy__title">
                        Политика конфиденциальности персональных данных
                    </h1>

                    <div class="privacy__subtitle">
                        Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую мобильное приложение, расположенное на платформах Google Play и App Store, может получить о Пользователе во время использования мобильного приложения,  а также сайта.
                    </div>

                    <div class="privacy__section">
                        <h2 class="privacy__section-title">1. Определение терминов</h2>
                        <div class="privacy__content">
                            <p class="privacy__paragraph">В настоящей Политике конфиденциальности используются следующие термины:</p>
                            <p class="privacy__paragraph"><span class="privacy__term">1.1.1. «Администрация мобильного приложения и сайта»</span> – уполномоченные сотрудники на управление мобильным приложением и сайтом, действующие от имени заведения, которые организуют и (или) осуществляет обработку персональных данных, а также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.</p>
                            <p class="privacy__paragraph"><span class="privacy__term">1.1.2. «Персональные данные»</span> – любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).</p>
                            <p class="privacy__paragraph"><span class="privacy__term">1.1.3. «Обработка персональных данных»</span> – любое действие (операция) или совокупность действий (операций) совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.</p>
                            <p class="privacy__paragraph"><span class="privacy__term">1.1.4. «Конфиденциальность персональных данных»</span> – обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.</p>
                            <p class="privacy__paragraph"><span class="privacy__term">1.1.5. «Пользователь мобильного приложения и сайта (далее Пользователь)»</span> – лицо, имеющее доступ к мобильному приложению и сайту посредством сети Интернет и использующее приложение и сайт.</p>
                            <p class="privacy__paragraph"><span class="privacy__term">1.1.6. «Cookies»</span> – небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в НТТР-запросе при попытке открыть страницу соответствующего сайта.</p>
                            <p class="privacy__paragraph"><span class="privacy__term">1.1.7. «ІР-адрес»</span> – уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу ІР.</p>
                        </div>
                    </div>

                    <div class="privacy__section">
                        <h2 class="privacy__section-title">2. Общие положения</h2>
                        <div class="privacy__content">
                            <p class="privacy__paragraph">2.1. Использование Пользователем мобильного приложения и сайта означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.</p>
                            <p class="privacy__paragraph">2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование мобильного приложения и сайта.</p>
                            <p class="privacy__paragraph">2.3. Настоящая Политика конфиденциальности применяется к мобильному приложению и сайту.</p>
                            <p class="privacy__paragraph">2.4. Администрация мобильного приложения и сайта не проверяет достоверность персональных данных, предоставляемых Пользователем приложения и сайта.</p>
                            <p class="privacy__paragraph">2.5. Персональные данные хранятся на серверах Аimet.uz, на территории Республики Узбекистан.</p>
                        </div>
                    </div>

                    <div class="privacy__section">
                        <h2 class="privacy__section-title">3. Предмет политики конфиденциальности</h2>
                        <div class="privacy__content">
                            <p class="privacy__paragraph">3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации мобильного приложения и сайта по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации мобильного приложения и сайта при регистрации в приложении и на сайте или при оформлении заказа для приобретения Товара.</p>
                            <p class="privacy__paragraph">3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения регистрационной формы в мобильном приложении и сайте и включают в себя следующую информацию:</p>
                            <p class="privacy__paragraph">3.2.1. фамилию, имя Пользователя;</p>
                            <p class="privacy__paragraph">3.2.2. контактный телефон Пользователя;</p>
                            <p class="privacy__paragraph">3.2.3. адрес доставки Товара.</p>
                            <p class="privacy__paragraph">3.3. Мобильное приложение и сайт осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью выявления и решения технических проблем, для контроля законности проводимых финансовых платежей.</p>
                            <p class="privacy__paragraph">3.4. Любая иная персональная информация неоговоренная выше (история заказов и т.д.) подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в п.п. 5.2. и 5.3. настоящей Политики конфиденциальности.</p>
                        </div>
                    </div>

                    <div class="privacy__section">
                        <h2 class="privacy__section-title">4. Цели сбора персональной информации пользователя</h2>
                        <div class="privacy__content">
                            <p class="privacy__paragraph">4.1. Персональные данные Пользователя Администрация мобильного приложения и сайта может использовать в целях:</p>
                            <p class="privacy__paragraph">4.1.1. Идентификации Пользователя, зарегистрированного в мобильном приложении и на сайте, для оформления заказа.</p>
                            <p class="privacy__paragraph">4.1.2. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования мобильного приложения и сайта, оказания услуг, обработка запросов и заявок от Пользователя.</p>
                            <p class="privacy__paragraph">4.1.3. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.</p>
                            <p class="privacy__paragraph">4.1.4. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.</p>
                            <p class="privacy__paragraph">4.1.5. Уведомления Пользователя мобильного приложения и сайта о состоянии Заказа.</p>
                            <p class="privacy__paragraph">4.1.6. Обработки и получения платежей Пользователя.</p>
                            <p class="privacy__paragraph">4.1.7. Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем, связанных с использованием мобильного приложения и сайта.</p>
                            <p class="privacy__paragraph">4.1.8. Предоставления Пользователю с его согласия, обновлений продукции, специальных предложений, информации о ценах, новостной рассылки и иных сведений от мобильного приложения и сайта.</p>
                            <p class="privacy__paragraph">4.1.9. Осуществления рекламной деятельности с согласия Пользователя.</p>
                        </div>
                    </div>

                    <div class="privacy__section">
                        <h2 class="privacy__section-title">5. Способы и сроки обработки персональной информации</h2>
                        <div class="privacy__content">
                            <p class="privacy__paragraph">5.1. Обработка персональных данных Пользователя осуществляется любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств. Персональные данные хранятся не дольше, чем необходимо для целей обработки, либо до момента отзыва согласия Пользователем.</p>
                            <p class="privacy__paragraph">5.2. Пользователь соглашается с тем, что Администрация мобильного приложения и сайта вправе передавать персональные данные третьим лицам, в частности, курьерским службам, организациями почтовой связи, операторам электросвязи, исключительно в целях выполнения заказа Пользователя, оформленного в мобильном приложении и на сайте, включая доставку Товара.</p>
                            <p class="privacy__paragraph">5.3. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Республики Узбекистан только по основаниям и в порядке, установленным законодательством Республики Узбекистан.</p>
                            <p class="privacy__paragraph">5.4. При утрате или разглашении персональных данных Администрация мобильного приложения и сайта информирует Пользователя об утрате или разглашении персональных данных.</p>
                            <p class="privacy__paragraph">5.5. Администрация мобильного приложения и сайта принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.</p>
                            <p class="privacy__paragraph">5.6. Администрация мобильного приложения и сайта совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.</p>
                        </div>
                    </div>

                    <div class="privacy__section">
                        <h2 class="privacy__section-title">6. Обязательства сторон</h2>
                        <div class="privacy__content">
                            <p class="privacy__paragraph">6.1. Пользователь обязан:</p>
                            <p class="privacy__paragraph">6.1.1. Предоставить информацию о персональных данных, необходимую для пользования мобильным приложением и сайта.</p>
                            <p class="privacy__paragraph">6.1.2. Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.</p>
                            <p class="privacy__paragraph">6.2. Пользователь вправе отозвать согласие на обработку персональных данных, направив письменное заявление на адрес электронной почты <a href="mailto:privacy@foodpicasso.com">privacy@foodpicasso.com</a>. После получения отзыва персональные данные подлежат удалению, за исключением случаев, когда их хранение необходимо в соответствии с требованиями законодательства.</p>
                            <p class="privacy__paragraph">6.3. Администрация мобильного приложения и сайта обязана:</p>
                            <p class="privacy__paragraph">6.3.1. Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.</p>
                            <p class="privacy__paragraph">6.3.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2. и 5.3. настоящей Политики Конфиденциальности.</p>
                            <p class="privacy__paragraph">6.3.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в существующем деловом обороте.</p>
                            <p class="privacy__paragraph">6.3.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.</p>
                        </div>
                    </div>

                    <div class="privacy__section">
                        <h2 class="privacy__section-title">7. Ответственность сторон</h2>
                        <div class="privacy__content">
                            <p class="privacy__paragraph">7.1. Администрация мобильного приложения и сайта, не исполнившая свои обязательства, несёт ответственность за убытки, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Республики Узбекистан, за исключением случаев, предусмотренных п.п. 5.2.5.3. и 7.2. настоящей Политики Конфиденциальности.</p>
                            <p class="privacy__paragraph">7.2. В случае утраты или разглашения Конфиденциальной информации Администрация мобильного приложения и сайта не несёт ответственность, если данная конфиденциальная информация:</p>
                            <p class="privacy__paragraph">7.2.1. Стала публичным достоянием до её утраты или разглашения.</p>
                            <p class="privacy__paragraph">7.2.2. Была получена от третьей стороны до момента её получения Администрацией мобильного приложения и сайта.</p>
                            <p class="privacy__paragraph">7.2.3. Была разглашена с согласия Пользователя.</p>
                        </div>
                    </div>

                    <div class="privacy__section">
                        <h2 class="privacy__section-title">8. Разрешение споров</h2>
                        <div class="privacy__content">
                            <p class="privacy__paragraph">8.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем и Администрацией мобильного приложения и сайта, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).</p>
                            <p class="privacy__paragraph">8.2. Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно уведомляет заявителя претензии о результатах рассмотрения претензии.</p>
                            <p class="privacy__paragraph">8.3. При не достижении соглашения спор будет передан на рассмотрение в судебный орган в соответствии с действующим законодательством Республики Узбекистан.</p>
                            <p class="privacy__paragraph">8.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией мобильного приложения и сайта применяется действующее законодательство Республики Узбекистан.</p>
                        </div>
                    </div>

                    <div class="privacy__section">
                        <h2 class="privacy__section-title">9. Дополнительные условия</h2>
                        <div class="privacy__content">
                            <p class="privacy__paragraph">9.1. Администрация мобильного приложения и сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.</p>
                            <p class="privacy__paragraph">9.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения в мобильном приложении и на сайте, если иное не предусмотрено новой редакцией Политики конфиденциальности.</p>
                            <p class="privacy__paragraph">9.3. Все предложения или вопросы по настоящей Политике конфиденциальности следует сообщать на странице <a href="https://www.foodpicasso.com" target="_blank">www.foodpicasso.com</a>.</p>
                        </div>
                    </div>

                    <div class="privacy__section">
                        <h2 class="privacy__section-title">10. Оператор персональных данных</h2>
            <div class="privacy__content">
                            <p class="privacy__paragraph">ИПООО «FAST FOOD SYSTEMS»</p>
                            <p class="privacy__paragraph">Адрес: Яккасарайский район, ул. Бобур 74, Армугон МФЙ, Узбекистан, г. Ташкент, 100029</p>
                            <p class="privacy__paragraph">Банковские реквизиты:</p>
                            <p class="privacy__paragraph">р/с № 20214840305705611001</p>
                            <p class="privacy__paragraph">ОПЕРУ АКБ «Asia Alliance Bank»</p>
                            <p class="privacy__paragraph">МФО: 01095</p>
                            <p class="privacy__paragraph">ИНН: 310839380</p>
                            <p class="privacy__paragraph">Код плательщика НДС: 326040239890</p>
                            <p class="privacy__paragraph">ОКЭД: 56100</p>
                        </div>
                    </div>

                </div>
            </div>
        </div>
    </section>

    <Footer />
</template>

<style src="./privacy.css" scoped>
</style>

